app/Controllers/ConCiudadanos.php

    public function verCiudadanos()
    {

        $ciudadanos = new CiudadanosModel();
        $datos['datos'] = $ciudadanos->findAll();
---
SELECT *
FROM `ciudadanos`