app/Controllers/ConDeps.php

    public function verDeps()
    {

        $departamentos = new DepartamentoModel();
        $datos['datos'] = $departamentos->findAll();
---
SELECT *
FROM `departamentos`