app/Controllers/ConNivelesAcademicos.php

SELECT *
FROM `nivelesacademicos`
---
    public function index(): string
    {
        $nivelesAcademicos = new NivelesAcademicosModel();
        $datos['datos'] = $nivelesAcademicos->findAll();

SELECT *
FROM `nivelesacademicos`
WHERE `cod_nivel_acad` = '2'
 LIMIT 1
---
    public function buscarNivelAcademico($id)
    {
        $nivelesAcademicos = new NivelesAcademicosModel();
        $datos['datos']=$nivelesAcademicos->where('cod_nivel_acad',$id)->first();